SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_rac.h
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_MASK                        0x700000UL                                                       /**< Bit mask for RAC_TX0DBMTRIMTAPCAP100F       */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_DEFAULT                     0x00000000UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_0f                0x00000000UL                                                     /**< Mode Ctap_plus_0f for RAC_PATRIM1           */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_100f              0x00000001UL                                                     /**< Mode Ctap_plus_100f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_200f              0x00000002UL                                                     /**< Mode Ctap_plus_200f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_300f              0x00000003UL                                                     /**< Mode Ctap_plus_300f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_400f              0x00000004UL                                                     /**< Mode Ctap_plus_400f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_500f              0x00000005UL                                                     /**< Mode Ctap_plus_500f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_600f              0x00000006UL                                                     /**< Mode Ctap_plus_600f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_700f              0x00000007UL                                                     /**< Mode Ctap_plus_700f for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_DEFAULT                      (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_DEFAULT << 20)                /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_0f                 (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_0f << 20)           /**< Shifted mode Ctap_plus_0f for RAC_PATRIM1   */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_100f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_100f << 20)         /**< Shifted mode Ctap_plus_100f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_200f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_200f << 20)         /**< Shifted mode Ctap_plus_200f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_300f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_300f << 20)         /**< Shifted mode Ctap_plus_300f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_400f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_400f << 20)         /**< Shifted mode Ctap_plus_400f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_500f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_500f << 20)         /**< Shifted mode Ctap_plus_500f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_600f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_600f << 20)         /**< Shifted mode Ctap_plus_600f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_700f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_Ctap_plus_700f << 20)         /**< Shifted mode Ctap_plus_700f for RAC_PATRIM1 */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_SHIFT                       24                                                               /**< Shift value for RAC_TX0DBMTRIMTAPCAP200F    */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_MASK                        0x7000000UL                                                      /**< Bit mask for RAC_TX0DBMTRIMTAPCAP200F       */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_DEFAULT                     0x00000003UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_0f                0x00000000UL                                                     /**< Mode Ctap_plus_0f for RAC_PATRIM1           */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_200f              0x00000001UL                                                     /**< Mode Ctap_plus_200f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_400f              0x00000002UL                                                     /**< Mode Ctap_plus_400f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_600f              0x00000003UL                                                     /**< Mode Ctap_plus_600f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_800f              0x00000004UL                                                     /**< Mode Ctap_plus_800f for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p                0x00000005UL                                                     /**< Mode Ctap_plus_1p for RAC_PATRIM1           */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p2p              0x00000006UL                                                     /**< Mode Ctap_plus_1p2p for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p4p              0x00000007UL                                                     /**< Mode Ctap_plus_1p4p for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_DEFAULT                      (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_DEFAULT << 24)                /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_0f                 (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_0f << 24)           /**< Shifted mode Ctap_plus_0f for RAC_PATRIM1   */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_200f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_200f << 24)         /**< Shifted mode Ctap_plus_200f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_400f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_400f << 24)         /**< Shifted mode Ctap_plus_400f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_600f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_600f << 24)         /**< Shifted mode Ctap_plus_600f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_800f               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_800f << 24)         /**< Shifted mode Ctap_plus_800f for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p                 (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p << 24)           /**< Shifted mode Ctap_plus_1p for RAC_PATRIM1   */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p2p               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p2p << 24)         /**< Shifted mode Ctap_plus_1p2p for RAC_PATRIM1 */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p4p               (_RAC_PATRIM1_TX0DBMTRIMTAPCAP200F_Ctap_plus_1p4p << 24)         /**< Shifted mode Ctap_plus_1p4p for RAC_PATRIM1 */

/* Bit fields for RAC PATRIM2 */
#define _RAC_PATRIM2_RESETVALUE                                       0x00000000UL                                      /**< Default value for RAC_PATRIM2               */
#define _RAC_PATRIM2_MASK                                             0x00007777UL                                      /**< Mask for RAC_PATRIM2                        */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_SHIFT                          0                                                 /**< Shift value for RAC_TX0DBMTRIMDUTYCYN       */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_MASK                           0x7UL                                             /**< Bit mask for RAC_TX0DBMTRIMDUTYCYN          */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_0pct                        0x00000000UL                                      /**< Mode up_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_1pct                        0x00000001UL                                      /**< Mode up_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_2pct                        0x00000002UL                                      /**< Mode up_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_3pct                        0x00000003UL                                      /**< Mode up_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_4pct                        0x00000004UL                                      /**< Mode up_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_5pct                        0x00000005UL                                      /**< Mode up_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_6pct                        0x00000006UL                                      /**< Mode up_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYN_na                             0x00000007UL                                      /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_DEFAULT                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_DEFAULT << 0)     /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_0pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_0pct << 0)     /**< Shifted mode up_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_1pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_1pct << 0)     /**< Shifted mode up_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_2pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_2pct << 0)     /**< Shifted mode up_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_3pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_3pct << 0)     /**< Shifted mode up_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_4pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_4pct << 0)     /**< Shifted mode up_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_5pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_5pct << 0)     /**< Shifted mode up_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_6pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_up_6pct << 0)     /**< Shifted mode up_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYN_na                              (_RAC_PATRIM2_TX0DBMTRIMDUTYCYN_na << 0)          /**< Shifted mode na for RAC_PATRIM2             */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_SHIFT                          4                                                 /**< Shift value for RAC_TX0DBMTRIMDUTYCYP       */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_MASK                           0x70UL                                            /**< Bit mask for RAC_TX0DBMTRIMDUTYCYP          */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_0pct                        0x00000000UL                                      /**< Mode dn_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_1pct                        0x00000001UL                                      /**< Mode dn_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_2pct                        0x00000002UL                                      /**< Mode dn_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_3pct                        0x00000003UL                                      /**< Mode dn_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_4pct                        0x00000004UL                                      /**< Mode dn_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_5pct                        0x00000005UL                                      /**< Mode dn_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_6pct                        0x00000006UL                                      /**< Mode dn_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX0DBMTRIMDUTYCYP_na                             0x00000007UL                                      /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_DEFAULT                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_0pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_0pct << 4)     /**< Shifted mode dn_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_1pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_1pct << 4)     /**< Shifted mode dn_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_2pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_2pct << 4)     /**< Shifted mode dn_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_3pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_3pct << 4)     /**< Shifted mode dn_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_4pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_4pct << 4)     /**< Shifted mode dn_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_5pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_5pct << 4)     /**< Shifted mode dn_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_6pct                         (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_dn_6pct << 4)     /**< Shifted mode dn_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX0DBMTRIMDUTYCYP_na                              (_RAC_PATRIM2_TX0DBMTRIMDUTYCYP_na << 4)          /**< Shifted mode na for RAC_PATRIM2             */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_SHIFT                       8                                                 /**< Shift value for RAC_TXPATRIM10DBMDUTYCYN    */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_MASK                        0x700UL                                           /**< Bit mask for RAC_TXPATRIM10DBMDUTYCYN       */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_0pct                     0x00000000UL                                      /**< Mode up_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_1pct                     0x00000001UL                                      /**< Mode up_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_2pct                     0x00000002UL                                      /**< Mode up_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_3pct                     0x00000003UL                                      /**< Mode up_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_4pct                     0x00000004UL                                      /**< Mode up_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_5pct                     0x00000005UL                                      /**< Mode up_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_6pct                     0x00000006UL                                      /**< Mode up_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_na                          0x00000007UL                                      /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_DEFAULT                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_DEFAULT << 8)  /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_0pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_0pct << 8)  /**< Shifted mode up_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_1pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_1pct << 8)  /**< Shifted mode up_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_2pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_2pct << 8)  /**< Shifted mode up_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_3pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_3pct << 8)  /**< Shifted mode up_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_4pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_4pct << 8)  /**< Shifted mode up_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_5pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_5pct << 8)  /**< Shifted mode up_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_6pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_up_6pct << 8)  /**< Shifted mode up_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_na                           (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYN_na << 8)       /**< Shifted mode na for RAC_PATRIM2             */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_SHIFT                       12                                                /**< Shift value for RAC_TXPATRIM10DBMDUTYCYP    */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_MASK                        0x7000UL                                          /**< Bit mask for RAC_TXPATRIM10DBMDUTYCYP       */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_0pct                     0x00000000UL                                      /**< Mode dn_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_1pct                     0x00000001UL                                      /**< Mode dn_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_2pct                     0x00000002UL                                      /**< Mode dn_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_3pct                     0x00000003UL                                      /**< Mode dn_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_4pct                     0x00000004UL                                      /**< Mode dn_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_5pct                     0x00000005UL                                      /**< Mode dn_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_6pct                     0x00000006UL                                      /**< Mode dn_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_na                          0x00000007UL                                      /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_DEFAULT                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_DEFAULT << 12) /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_0pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_0pct << 12) /**< Shifted mode dn_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_1pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_1pct << 12) /**< Shifted mode dn_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_2pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_2pct << 12) /**< Shifted mode dn_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_3pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_3pct << 12) /**< Shifted mode dn_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_4pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_4pct << 12) /**< Shifted mode dn_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_5pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_5pct << 12) /**< Shifted mode dn_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_6pct                      (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_dn_6pct << 12) /**< Shifted mode dn_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_na                           (_RAC_PATRIM2_TXPATRIM10DBMDUTYCYP_na << 12)      /**< Shifted mode na for RAC_PATRIM2             */

