SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_rac.h
#define RAC_PATRIM3_TXPATRIMREGVREF_DEFAULT                           (_RAC_PATRIM3_TXPATRIMREGVREF_DEFAULT << 20)             /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p651                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p651 << 20)          /**< Shifted mode vref_0p651 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p663                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p663 << 20)          /**< Shifted mode vref_0p663 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p676                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p676 << 20)          /**< Shifted mode vref_0p676 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p688                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p688 << 20)          /**< Shifted mode vref_0p688 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p701                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p701 << 20)          /**< Shifted mode vref_0p701 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p713                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p713 << 20)          /**< Shifted mode vref_0p713 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p726                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p726 << 20)          /**< Shifted mode vref_0p726 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p738                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p738 << 20)          /**< Shifted mode vref_0p738 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p751                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p751 << 20)          /**< Shifted mode vref_0p751 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p763                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p763 << 20)          /**< Shifted mode vref_0p763 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p776                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p776 << 20)          /**< Shifted mode vref_0p776 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p788                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p788 << 20)          /**< Shifted mode vref_0p788 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p801                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p801 << 20)          /**< Shifted mode vref_0p801 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p813                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p813 << 20)          /**< Shifted mode vref_0p813 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p826                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p826 << 20)          /**< Shifted mode vref_0p826 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGVREF_vref_0p838                        (_RAC_PATRIM3_TXPATRIMREGVREF_vref_0p838 << 20)          /**< Shifted mode vref_0p838 for RAC_PATRIM3     */

/* Bit fields for RAC PATRIM4 */
#define _RAC_PATRIM4_RESETVALUE                                       0x00006000UL                                         /**< Default value for RAC_PATRIM4               */
#define _RAC_PATRIM4_MASK                                             0x03FFFFFFUL                                         /**< Mask for RAC_PATRIM4                        */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_SHIFT                          0                                                    /**< Shift value for RAC_TXPATRIM10DBMCTAP       */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_MASK                           0xFUL                                                /**< Bit mask for RAC_TXPATRIM10DBMCTAP          */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_0                    0x00000000UL                                         /**< Mode ctap_trim_0 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_1                    0x00000001UL                                         /**< Mode ctap_trim_1 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_2                    0x00000002UL                                         /**< Mode ctap_trim_2 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_3                    0x00000003UL                                         /**< Mode ctap_trim_3 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_4                    0x00000004UL                                         /**< Mode ctap_trim_4 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_5                    0x00000005UL                                         /**< Mode ctap_trim_5 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_6                    0x00000006UL                                         /**< Mode ctap_trim_6 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_7                    0x00000007UL                                         /**< Mode ctap_trim_7 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_8                    0x00000008UL                                         /**< Mode ctap_trim_8 for RAC_PATRIM4            */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_DEFAULT                         (_RAC_PATRIM4_TXPATRIM10DBMCTAP_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_0                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_0 << 0)    /**< Shifted mode ctap_trim_0 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_1                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_1 << 0)    /**< Shifted mode ctap_trim_1 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_2                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_2 << 0)    /**< Shifted mode ctap_trim_2 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_3                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_3 << 0)    /**< Shifted mode ctap_trim_3 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_4                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_4 << 0)    /**< Shifted mode ctap_trim_4 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_5                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_5 << 0)    /**< Shifted mode ctap_trim_5 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_6                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_6 << 0)    /**< Shifted mode ctap_trim_6 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_7                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_7 << 0)    /**< Shifted mode ctap_trim_7 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_8                     (_RAC_PATRIM4_TXPATRIM10DBMCTAP_ctap_trim_8 << 0)    /**< Shifted mode ctap_trim_8 for RAC_PATRIM4    */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_SHIFT                     4                                                    /**< Shift value for RAC_TXPATRIM10DBMPREDRVCAP  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_MASK                      0x30UL                                               /**< Bit mask for RAC_TXPATRIM10DBMPREDRVCAP     */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_DEFAULT                   0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_0                     0x00000000UL                                         /**< Mode cap_0 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_1                     0x00000001UL                                         /**< Mode cap_1 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_2                     0x00000002UL                                         /**< Mode cap_2 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_3                     0x00000003UL                                         /**< Mode cap_3 for RAC_PATRIM4                  */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_DEFAULT                    (_RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_0                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_0 << 4)     /**< Shifted mode cap_0 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_1                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_1 << 4)     /**< Shifted mode cap_1 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_2                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_2 << 4)     /**< Shifted mode cap_2 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_3                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVCAP_cap_3 << 4)     /**< Shifted mode cap_3 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_SHIFT                     6                                                    /**< Shift value for RAC_TXPATRIM10DBMPREDRVSLC  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_MASK                      0xC0UL                                               /**< Bit mask for RAC_TXPATRIM10DBMPREDRVSLC     */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_DEFAULT                   0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_0                     0x00000000UL                                         /**< Mode slc_0 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_1                     0x00000001UL                                         /**< Mode slc_1 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_2                     0x00000002UL                                         /**< Mode slc_2 for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_3                     0x00000003UL                                         /**< Mode slc_3 for RAC_PATRIM4                  */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_DEFAULT                    (_RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_DEFAULT << 6)   /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_0                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_0 << 6)     /**< Shifted mode slc_0 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_1                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_1 << 6)     /**< Shifted mode slc_1 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_2                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_2 << 6)     /**< Shifted mode slc_2 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_3                      (_RAC_PATRIM4_TXPATRIM10DBMPREDRVSLC_slc_3 << 6)     /**< Shifted mode slc_3 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_SHIFT                          8                                                    /**< Shift value for RAC_TXPATRIM20DBMCTAP       */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_MASK                           0xF00UL                                              /**< Bit mask for RAC_TXPATRIM20DBMCTAP          */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_0                    0x00000000UL                                         /**< Mode ctap_trim_0 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_1                    0x00000001UL                                         /**< Mode ctap_trim_1 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_2                    0x00000002UL                                         /**< Mode ctap_trim_2 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_3                    0x00000003UL                                         /**< Mode ctap_trim_3 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_4                    0x00000004UL                                         /**< Mode ctap_trim_4 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_5                    0x00000005UL                                         /**< Mode ctap_trim_5 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_6                    0x00000006UL                                         /**< Mode ctap_trim_6 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_7                    0x00000007UL                                         /**< Mode ctap_trim_7 for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_8                    0x00000008UL                                         /**< Mode ctap_trim_8 for RAC_PATRIM4            */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_DEFAULT                         (_RAC_PATRIM4_TXPATRIM20DBMCTAP_DEFAULT << 8)        /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_0                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_0 << 8)    /**< Shifted mode ctap_trim_0 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_1                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_1 << 8)    /**< Shifted mode ctap_trim_1 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_2                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_2 << 8)    /**< Shifted mode ctap_trim_2 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_3                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_3 << 8)    /**< Shifted mode ctap_trim_3 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_4                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_4 << 8)    /**< Shifted mode ctap_trim_4 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_5                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_5 << 8)    /**< Shifted mode ctap_trim_5 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_6                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_6 << 8)    /**< Shifted mode ctap_trim_6 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_7                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_7 << 8)    /**< Shifted mode ctap_trim_7 for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_8                     (_RAC_PATRIM4_TXPATRIM20DBMCTAP_ctap_trim_8 << 8)    /**< Shifted mode ctap_trim_8 for RAC_PATRIM4    */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_SHIFT                        12                                                   /**< Shift value for RAC_TXPATRIM20DBMPREDRV     */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_MASK                         0xF000UL                                             /**< Bit mask for RAC_TXPATRIM20DBMPREDRV        */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_DEFAULT                      0x00000006UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_137ps                  0x00000000UL                                         /**< Mode trise_137ps for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_127ps                  0x00000001UL                                         /**< Mode trise_127ps for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_117ps                  0x00000002UL                                         /**< Mode trise_117ps for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_110ps                  0x00000003UL                                         /**< Mode trise_110ps for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_75ps                   0x00000004UL                                         /**< Mode trise_75ps for RAC_PATRIM4             */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_73ps                   0x00000005UL                                         /**< Mode trise_73ps for RAC_PATRIM4             */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_71ps                   0x00000006UL                                         /**< Mode trise_71ps for RAC_PATRIM4             */
#define _RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_70ps                   0x00000007UL                                         /**< Mode trise_70ps for RAC_PATRIM4             */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_DEFAULT                       (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_DEFAULT << 12)     /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_137ps                   (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_137ps << 12) /**< Shifted mode trise_137ps for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_127ps                   (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_127ps << 12) /**< Shifted mode trise_127ps for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_117ps                   (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_117ps << 12) /**< Shifted mode trise_117ps for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_110ps                   (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_110ps << 12) /**< Shifted mode trise_110ps for RAC_PATRIM4    */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_75ps                    (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_75ps << 12)  /**< Shifted mode trise_75ps for RAC_PATRIM4     */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_73ps                    (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_73ps << 12)  /**< Shifted mode trise_73ps for RAC_PATRIM4     */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_71ps                    (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_71ps << 12)  /**< Shifted mode trise_71ps for RAC_PATRIM4     */
#define RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_70ps                    (_RAC_PATRIM4_TXPATRIM20DBMPREDRV_trise_70ps << 12)  /**< Shifted mode trise_70ps for RAC_PATRIM4     */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTM_SHIFT                          16                                                   /**< Shift value for RAC_TXPATRIMCAPPAOUTM       */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTM_MASK                           0xF0000UL                                            /**< Bit mask for RAC_TXPATRIMCAPPAOUTM          */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTM_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define RAC_PATRIM4_TXPATRIMCAPPAOUTM_DEFAULT                         (_RAC_PATRIM4_TXPATRIMCAPPAOUTM_DEFAULT << 16)       /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTP_SHIFT                          20                                                   /**< Shift value for RAC_TXPATRIMCAPPAOUTP       */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTP_MASK                           0xF00000UL                                           /**< Bit mask for RAC_TXPATRIMCAPPAOUTP          */
#define _RAC_PATRIM4_TXPATRIMCAPPAOUTP_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define RAC_PATRIM4_TXPATRIMCAPPAOUTP_DEFAULT                         (_RAC_PATRIM4_TXPATRIMCAPPAOUTP_DEFAULT << 20)       /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define _RAC_PATRIM4_TXPATRIMCMGAIN_SHIFT                             24                                                   /**< Shift value for RAC_TXPATRIMCMGAIN          */
#define _RAC_PATRIM4_TXPATRIMCMGAIN_MASK                              0x3000000UL                                          /**< Bit mask for RAC_TXPATRIMCMGAIN             */
#define _RAC_PATRIM4_TXPATRIMCMGAIN_DEFAULT                           0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM4                */
#define RAC_PATRIM4_TXPATRIMCMGAIN_DEFAULT                            (_RAC_PATRIM4_TXPATRIMCMGAIN_DEFAULT << 24)          /**< Shifted mode DEFAULT for RAC_PATRIM4        */

