SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_rac.h
/* Bit fields for RAC AGCOVERWRITE1 */
#define _RAC_AGCOVERWRITE1_RESETVALUE                                 0x00000000UL                                       /**< Default value for RAC_AGCOVERWRITE1         */
#define _RAC_AGCOVERWRITE1_MASK                                       0x3FFF3FFFUL                                       /**< Mask for RAC_AGCOVERWRITE1                  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_SHIFT                      0                                                  /**< Shift value for RAC_MANLNAMIXRFATT0         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_MASK                       0x3FFFUL                                           /**< Bit mask for RAC_MANLNAMIXRFATT0            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                     (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_SHIFT                      16                                                 /**< Shift value for RAC_MANLNAMIXRFATT1         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_MASK                       0x3FFF0000UL                                       /**< Bit mask for RAC_MANLNAMIXRFATT1            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                     (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */

/* Bit fields for RAC AGCOVERWRITE2 */
#define _RAC_AGCOVERWRITE2_RESETVALUE                                 0x00000000UL                                           /**< Default value for RAC_AGCOVERWRITE2         */
#define _RAC_AGCOVERWRITE2_MASK                                       0x0000FFFFUL                                           /**< Mask for RAC_AGCOVERWRITE2                  */
#define RAC_AGCOVERWRITE2_ENMANFENOTCH                                (0x1UL << 0)                                           /**< Enable RAC Overwrite FENOTCH                */
#define _RAC_AGCOVERWRITE2_ENMANFENOTCH_SHIFT                         0                                                      /**< Shift value for RAC_ENMANFENOTCH            */
#define _RAC_AGCOVERWRITE2_ENMANFENOTCH_MASK                          0x1UL                                                  /**< Bit mask for RAC_ENMANFENOTCH               */
#define _RAC_AGCOVERWRITE2_ENMANFENOTCH_DEFAULT                       0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_ENMANFENOTCH_DEFAULT                        (_RAC_AGCOVERWRITE2_ENMANFENOTCH_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define RAC_AGCOVERWRITE2_MANFENOTCHEN                                (0x1UL << 1)                                           /**< RAC Overwrite fenotchen                     */
#define _RAC_AGCOVERWRITE2_MANFENOTCHEN_SHIFT                         1                                                      /**< Shift value for RAC_MANFENOTCHEN            */
#define _RAC_AGCOVERWRITE2_MANFENOTCHEN_MASK                          0x2UL                                                  /**< Bit mask for RAC_MANFENOTCHEN               */
#define _RAC_AGCOVERWRITE2_MANFENOTCHEN_DEFAULT                       0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHEN_DEFAULT                        (_RAC_AGCOVERWRITE2_MANFENOTCHEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define _RAC_AGCOVERWRITE2_MANFENOTCHATTNSEL_SHIFT                    2                                                      /**< Shift value for RAC_MANFENOTCHATTNSEL       */
#define _RAC_AGCOVERWRITE2_MANFENOTCHATTNSEL_MASK                     0x3CUL                                                 /**< Bit mask for RAC_MANFENOTCHATTNSEL          */
#define _RAC_AGCOVERWRITE2_MANFENOTCHATTNSEL_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHATTNSEL_DEFAULT                   (_RAC_AGCOVERWRITE2_MANFENOTCHATTNSEL_DEFAULT << 2)    /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0                        (0x1UL << 6)                                           /**< RAC Overwrite fenotchrattnenrf0             */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0_SHIFT                 6                                                      /**< Shift value for RAC_MANFENOTCHRATTNENRF0    */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0_MASK                  0x40UL                                                 /**< Bit mask for RAC_MANFENOTCHRATTNENRF0       */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0_DEFAULT                (_RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF0_DEFAULT << 6) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1                        (0x1UL << 7)                                           /**< RAC Overwrite fenotchrattnenrf1             */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1_SHIFT                 7                                                      /**< Shift value for RAC_MANFENOTCHRATTNENRF1    */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1_MASK                  0x80UL                                                 /**< Bit mask for RAC_MANFENOTCHRATTNENRF1       */
#define _RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1_DEFAULT                (_RAC_AGCOVERWRITE2_MANFENOTCHRATTNENRF1_DEFAULT << 7) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPCRSE_SHIFT                    8                                                      /**< Shift value for RAC_MANFENOTCHCAPCRSE       */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPCRSE_MASK                     0xF00UL                                                /**< Bit mask for RAC_MANFENOTCHCAPCRSE          */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPCRSE_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHCAPCRSE_DEFAULT                   (_RAC_AGCOVERWRITE2_MANFENOTCHCAPCRSE_DEFAULT << 8)    /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPFINE_SHIFT                    12                                                     /**< Shift value for RAC_MANFENOTCHCAPFINE       */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPFINE_MASK                     0xF000UL                                               /**< Bit mask for RAC_MANFENOTCHCAPFINE          */
#define _RAC_AGCOVERWRITE2_MANFENOTCHCAPFINE_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for RAC_AGCOVERWRITE2          */
#define RAC_AGCOVERWRITE2_MANFENOTCHCAPFINE_DEFAULT                   (_RAC_AGCOVERWRITE2_MANFENOTCHCAPFINE_DEFAULT << 12)   /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE2  */

